//
//  ExplainViewController.swift
//  HackerTool
//
//  Created by עילי בוקובזה on 27/05/2022.
//

import UIKit

class ExplainViewController: UIViewController {

    @IBOutlet weak var titleTF: UILabel!
    @IBOutlet weak var explainTF: UITextView!
    
    override func viewDidLoad() {
        super.viewDidLoad()
        var mode = UserDefaults.standard.string(forKey: "mode")
        
        if mode == "wifi_scanning" {
            self.titleTF.text = "Wifi Scanner"
            self.explainTF.text = "איך סורק הרשת עובד? התוכנה בודקת את הכתובת של המכשיר הסורק, ואת מסיכת הרשת שלו. באמצעות שני הפרמטרים האלו אנחנו יודעים לבנות לולאה שתעבור על כל האופציות האפשרויות לכתובות אייפי ברשת הפנימית שלנו. בתוך הלולאה ולכל כתובת בנפרד, נרצה לנסות לשלוח פינג. פינג עובד על פרוטוקול היו.די.פי כלומר התקשורת היא איכותית. זה אומר שאם נשלח פינג לכתובת מסוימת, וכתובת זו קיימת ברשת, המכשיר יחזיר לנו תשובה וככה אנחנו יודעים שהמכשיר מחובר והכתובת היא כתובת אמיתית ברשת הפנימית."
        }else if mode == "mitm" {
            self.titleTF.text = "Man in the middle"
            self.explainTF.text = "איך עובדת התקפת 'איש באמצע'? לאחר שבחרנו את הכתובת של האדם שנרצה לתקוף וקיבלנו את הכתובת של הראוטר, הדבר הבא שנרצה לעשות הוא להחזות עבור אותו נתקף כהראוטר. כיצד נעשה זאת? ראשית, נשלח הודעת ברודקאסט לרשת באמצעות פרוטוקול ארפ ונבקש לדעת את הכתובות הפיזיות של המכשירים (הנתקף והראוטר). לאחר שעשינו זאת נרצה להתחיל להרעיל את הנתקפים שלנו. בכל מכשיר יש טבלה שנקראת טבלת ארפ, בטבלה זו נשמרים כל כתובות האייפי לצד כתובות הפיזיות שאותם המחשב מכיר. אנחנו נרצה לזבל את אותה טבלה ולזייף את כתובות המק על מנת שהתקשורת תעבור דרכנו. לאחר שהתקשורת עוברת דרכנו, נרצה בהגדרות המחשב להפעיל את מצב האייפי פורוורדינג על מנת שהתקשורת תחזור חזרה לנתקף שלנו. לאחר שעשינו זאת, מבחינת הנתקף, הוא לא יזהה כלום ואנחנו נוכל להסניף את הפקטות שהוא מעביר ומועברות אליו."
        }
        else if mode == "brute_force" {
            self.titleTF.text = "Brute Force"
            self.explainTF.text = "איך עובדת התקפת ברוט פורס? שרת זה יושב בענן ומבצע את כל הפעולות שלהלן על גבי שרתי הענן. השרת מדבר בפרוטוקול https ובעיקר בפוסטים. התקפה זה מבוססת ברובה על עקרון סייבר שנקרא הנדסה חברתית. כלומר, אתה צריך שיהיה לך קשר ישיר עם הנתקף. צריך לדעת באיזה אתרים הוא אוהב לגלוש, תאריך לידה, קרובים כו'. לאחר שהצלחנו להוציא את המידע מהבן אדם, נכניס את כל מה שאנחנו יודעים לתוכנה, והיא תיצור בעצמה קובץ עם אלפי סיסמאות אפשריות שמותאמות אך ורק לאותו אדם. הסיסמאות נוצרות ע''פ כל הקומבינציות האפשריות שנתנו במידע. לאחר מכן נרצה לדעת באיזה אתרים הנתקף גולש, לאחר שגילינו זאת נבדוק איזה מן האתרים לא מוגן בפני התקפת ברוט פורס. אין לאתר אימות דו שלבי, זיהוי רובוטי וכו'. לאחר מכן נרצה לזהות את כתובת מסך החיבור, נזהה את שמות הפרמטרים שהשרת יודע לקבל (ע''י לחיצה פשוטה על בדוק המרכיב בדפדפן). לאחר מכן נכניס את הכתובת של האתר, ושמות הפרמטרים. התוכנה תנסה כל סיסמא מקובץ הסיסמאות שלנו, עד שסיסמה אחת תעבוד. לאחר שמצאנו סיסמה, סביר להניח שסיסמה זו תשמש את הנתקף שלנו גם לשאר האתרים."
        }else if mode == "phishing" {
            self.titleTF.text = "Phishing"
            self.explainTF.text = "איך עובד עקרון הפישינג או בעברית דיוג? שרת זה מאוחסן בשרתי איחסון חיצוניים ולכן כל אחד יכול להתחבר לאתר זה באמצעות כתובת האתר. בהתקפה זו נרצה להתחזות בנראות לדף הכניסה באתר מוכר. בנק, פייסבוק וכדומה. לאחר שהצלחנו להעתיק את קבצי האתר (css,html) נרצה לקודד את כפתור ההתחברות, לקוד שאנחנו נכתוב. בקוד הזה אנחנו נקבל את הקלט שהמשתמש הזין ונעלה אותו לבסיס נתונים ששומר את כל הפרטים של האפליקציה. לאחר מכן נעביר את הנתקף לדף המקורי של האתר שאליו התחזינו והוא לעולם לא ידע שהוא נפל בחכת הדיג שלנו. המטרה בהתקפה זו היא להפיץ את כתובת האתר לכמה שיותר אנשים על מנת שאחוזי ההצלחה יהיו גבוהים כמה שיותר."
        }else if mode == "car_info" {
            self.titleTF.text = "Car Info"
            self.explainTF.text = "איך עובד עקרון הפישינג או בעברית דיוג? שרת זה מאוחסן בשרתי איחסון חיצוניים ולכן כל אחד יכול להתחבר לאתר זה באמצעות כתובת האתר. בהתקפה זו נרצה להתחזות בנראות לדףאף על פי שהסגמנט הספיציפי הזה לא נשען על שום עקרון סייבר ממשי. רציתי להדגים לתלמידים גם את האופציה לשימוש בAPI חיצוני ובweb scraping. השרת שבניתי מבוסס על HTTP GET REQUEST מקבל מספר רכב בכתובת הurl, ונכנס לאתר של משרד התחבורה שנקרא פיינד קאר. באתר זה מופיע דגם הרכב, שנת ייצור, ועוד המון מידע על הרכב שהוזן. השרת מבצע web scrapin  וקורא מידע רלוונטי. לאחר מכן הוא מחזיר את המידע והאפליקציה מציגה אותו."
        }
    }
    

}
